# Visualizing Data with Seaborn

## Penguins Data
---

### Setting a default style theme

In [1]:
import seaborn as sns

# Set the default style for visualizations
sns.set_theme(style = 'ticks', palette = 'Set2', font = 'Arial')

### Importing the data

In [2]:
# Load the Penguins example dataset into a dataframe
df_raw = sns.load_dataset('penguins')

# Make a new copy of df_raw (called df) for cleaning/transformation
df = df_raw.copy()

# Get a birds-eye view of the data
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [3]:
# Get summary info about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

### Inspecting the data

In [4]:
# Check for duplicate rows
total_duplicates = df.duplicated().sum()
print(f"There are {total_duplicates} duplicated rows in this dataset.")

There are 0 duplicated rows in this dataset.

In [5]:
# Check for null (i.e. NaN) values
df.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [6]:
# Get the rows that have NaN values
df[df.isna().any(axis = 1)]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN
336,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

### Cleaning the data
Since we won't be grouping by sex in our visualizations, we will keep the rows that only have NaNs for sex.  

However, since two rows (i.e. row index 3 & row index 339) have NaNs for all values except species and island, we will drop those two rows from our dataset.

In [7]:
# Drop row index 3 and row index 339
df = df.drop(df.index[[3, 339]])

In [10]:
# Check that the only column with NaNs is sex
df.isna().sum()

species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  9
dtype: int64

---

### 1. Create a scatter plot that includes the following parameters:
* bill_length_mm on the x-axis
* bill_depth_mm on the y-axis
* use hue to indicate species

### 2. Create a kde plot that includes the following parameters:
* display the distribution of body_mass_g 
* use hue to indica

### 3. Create a correlation matrix for the dataframe.  Use a heatmap to show the strength of the correlations.

### 4. Create a pairplot for the DataFrame.
* What (if any) variables/columns are positively correlated? 
* What (if any) variables/columns are negatively correlated? 
* What (if any) variables/columns are not correlated at all?

### 5. Create a swarm plot with the following features:
* 'island' on the x-axis.
* 'flipper length' on the y-axis.
* hue to indicate 'species'.